#ДЗ 6.3. Добуток чисел
#Завдання — написати програму, яка перемножує всі цифри, введені користувачем цілого числа,
#поки воно не стане менше або дорівнювати 9.
#Користувач вводить число з клавіатури.
# Приклади: 11341999
# #999 -> 2 # Ось чому - 999 розбиваємо на цифри і перемножуємо 9 * 9 * 9 = 729, Потім 7 * 2 * 9 = 126, потім 1 * 2 * 6 = 12 і в результаті 1 * 2 = 2
#1000 -> 0 , 423 -> 8 , 33 -> 9 , 25 -> 0 , 1 -> 1
#3499944 -> 6 , 23499999-> 8
var=23499999
print(var,"=> ", end="")
while var>9:
   lst=str(var)
   i=0
   rez=1
   while i < len(lst):
      rez=int(lst[i])*rez
      i=i+1
   var=rez
print(var)